

// ✳️ написать переменную, которая хранит объект с информацией о студенте: Имя(строка), фамилия(строка), группа(строка), текущий месяц обучения (число), является ли выпускником(логическое), направление(строка), сколько месяцев обучения прошел(число) 

/*

let student = {
    name: "Aliia",
    surname: "Bolotova",
    group: "IT124",
    month: 2,
    isGraduate: false,
    field: "IT",
    study: 2
}
console.log(student)
*/


// ✳️ написать переменную которая хранит объект банковского счета: номер счета(строка), валюта(строка), баланс(число), имя владельца(строка), заблокирован ли счет (логический тип).
// let bills = {
//     number: "5738490257",
//     currency: "KGS",
//     balance: 876,
//     ownerName: "Ais",
//     isBlocked: true
// }
// console.log(bills)


// ✳️ написать программу: нужно запрашивать у пользователя его имя и фамилию (отдельными prompt) и выводит приветствие в виде: Здравствуйте, Имя Фамилия!

// let name2 = String(prompt("Введите имя: "));
// let surname2 = String(prompt("Введите фамилию: "));
// document.writeln("Здравствуйте, " + name2 +" " +surname2)




// ✳️ Написать программу которая спрашивает у пользователя 2 числа(через prompt) и выводит в консоль какое больше. Если числа равны, то вывести что они равны.


// let num1 = Number(prompt("Введите число: "))
// let num2 = Number(prompt("Введите число: "))
// if(num1>num2){
//     document.writeln( " число" +num1+ " больше чем "+ num2)
// }else if(num1<num2) {
//     document.writeln(" число" +num2+ " больше чем "+ num1)
// }else{
//     document.writeln(" числа равны ")
// };



// ✳️ написать программу "светофор": программа запрашивает у пользователя цвет в текстовом виде, и печатает в консоль действие согласно ПДД. Например: красный : стой! желтый : жди и т.д.

// let color = String(prompt("Введите цвет: красный, желтый, зеленый").toLowerCase())
// if (color==='красный'){
//     console.log(color+ ": Стой!")
// }else if (color==='желтый'){
//     console.log(color+": Жди")
// }else if (color==="зеленый"){
//     console.log(color+': Иди')
// }else{
//     console.log('Такой цвет не прописан в условии')
// }


// ✳️ написать программу "конвертер чисел". Пользователь вводит число от 1 до 9, программа должна сконвертировать это число в римское. Например: 2 -> II, 5 -> V и т.д.

// let rome = Number(prompt("Введите число от 1 до 9: "))
// if (rome===1){
//     document.writeln(rome + "-> I")
// }else if (rome===2){
//     document.writeln(rome + "-> II")
// }else if (rome===3){
//     document.writeln(rome + "-> III")
// }else if (rome===4){
//     document.writeln(rome + "-> IV")
// }else if (rome===5){
//     document.writeln(rome + "-> V")
// }else if (rome===6){
//     document.writeln(rome + "-> VI")
// }else if (rome===7){
//     document.writeln(rome + "-> VII")
// }else if (rome===8){
//     document.writeln(rome + "-> VIII")
// }else if (rome===9){
//     document.writeln(rome + "-> IX")
// }else{
//     document.writeln('Вы ввели не то число')
// }



//запросить у пользователя число от 2 до 10 и с помощью цикла вывести таблицу умножения для этого числа в таком виде(я выбрал 4 для примера):
// 4 × 1 = 4
// 4 × 2 = 8
// 4 × 3 = 12
// ....
// 4 × 10 = 40

// let mul = Number(prompt("Введите число от 2 до 10: "));
// if (mul >= 2 && mul <= 10) {
//     for (let i = 1; i <= 10; i++) {
//         document.writeln(mul + " × " + i + " = " + mul * i + "<br>");
//     }
// } else {
//     document.writeln("Введите число от 2 до 10!");
// }



// ✳️ Есть массив с номерами банковских карт например, вот такой: ["46782346", "45781218", "79874568", "12157845", "36151845", "41250895", "41201961"]. Нужно посчитать сколько в этом массиве карт платежной системы VISA (у них номер карты начинается с цифры 4). В сообщение пользователю вывести в таком виде: Карт VISA 4 из 7.
let cards = ["46782346", "45781218", "79874568", "12157845", "36151845", "41250895", "41201961"];
let visaCount = 0;
for (let i = 0; i < cards.length; i++) {
        if (cards[i][0] === "4") {
                visaCount++;
            }
        }
        document.writeln("Карт VISA " + visaCount + " из " + cards.length);